DataProcessors/НеРазмещенныеТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>НеРазмещенныеТовары</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТоваровВБуфереРазмещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоТовара</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПроизводителяТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗагрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/НеРазмещенныеТовары/Forms/ФормаНеРазмещенныеТовары/Ext/Form/Module.bsl
&НаКлиенте
Процедура РазместитьТовары(Команда)
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ДокументГУИД", Параметры.ДокументГУИД);
	Закрыть( СписокПараметров );	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Объект.ОписаниеДокумента = Параметры.НомерДокументаОоформление;
	
	Сообщение = "По данному документу система ";
	Сообщение = Сообщение + "обнаружила ранее размещенные Вами в ячейках ";
	Сообщение = Сообщение + "товары, которые не были отражены в документе ";
	Сообщение = Сообщение + """Размещение товаров по ячейкам"".";
	Сообщение = Сообщение + "Проверьте нахождение этих товаров";
	Сообщение = Сообщение + "в указанных ячейках и нажмите на кнопку";
	
	ЭтаФорма.Объект.ТекстСообщения = Сообщение;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаписатьДанныеВРегистрСведений = Истина;
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзБуфераРазмещения(Параметры.ДокументГУИД, ЗаписатьДанныеВРегистрСведений);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Закрыть();	
		Возврат;
	КонецЕсли; 
	
	Для каждого СтрокаДанных Из РезультатСтруктура.Данные Цикл
		
		НоваяЗапись = Объект.СписокТоваровВБуфереРазмещения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаДанных);		
		НоваяЗапись.ДатаЗагрузки = ТекущаяДата();		
		
	КонецЦикла; 
					
	Оповестить("ОбновлениеДанных");
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеДанных" Тогда
		Элементы.СписокТоваровВБуфереРазмещения.Обновить();
	КонецЕсли; 

КонецПроцедуры
